In [22]:
import pandas as pd
import datetime as dt

In [23]:
# check new data
df = pd.read_csv('Absenteeism_new_data.csv')
df['Absenteeism Time in Hours'] = 0
df.head()

,ID,Reason for Absence,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,22,27,01/06/2018,179,26,30,237.656,19,3,0,0,0
1,10,7,04/06/2018,361,52,28,237.656,27,1,1,4,0
2,14,23,06/06/2018,155,12,34,237.656,25,1,2,0,0
3,17,25,08/06/2018,179,22,40,237.656,22,2,2,0,0
4,14,10,08/06/2018,155,12,34,237.656,25,1,2,0,0

In [24]:
df = df.drop(['ID'], axis =1)

In [25]:
reason_columns = pd.get_dummies(df['Reason for Absence'], drop_first = True)

In [26]:
reason_type_1 = reason_columns.loc[:, '1':'14'].max(axis=1)
reason_type_2 = reason_columns.loc[:, '15':'17'].max(axis=1)
reason_type_3 = reason_columns.loc[:, '18':'21'].max(axis=1)
reason_type_4 = reason_columns.loc[:, '22':].max(axis=1)

In [27]:
# to avoid multicollinearity, drop the 'reason for absence' column from df
df = df.drop(['Reason for Absence'], axis = 1)

# concatenate df and the 4 types of reason for absence
df = pd.concat([df, reason_type_1, reason_type_2, reason_type_3, reason_type_4], axis = 1)

In [28]:
df.head()

,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours,0,1,2,3
0,01/06/2018,179,26,30,237.656,19,3,0,0,0,0,NaN,0,1
1,04/06/2018,361,52,28,237.656,27,1,1,4,0,1,NaN,0,0
2,06/06/2018,155,12,34,237.656,25,1,2,0,0,0,NaN,0,1
3,08/06/2018,179,22,40,237.656,22,2,2,0,0,0,NaN,0,1
4,08/06/2018,155,12,34,237.656,25,1,2,0,0,1,NaN,0,0

In [29]:
#df['Date'] = df['Date'].apply(pd.to_datetime, errors='coerce')
df['Date'] = pd.to_datetime(df['Date'], format='%d/%m/%Y')

In [30]:
df['Date']

0    2018-06-01
1    2018-06-04
2    2018-06-06
3    2018-06-08
4    2018-06-08
5    2018-06-11
6    2018-06-13
7    2018-06-13
8    2018-06-15
9    2018-06-20
10   2018-06-21
11   2018-06-21
12   2018-06-22
13   2018-06-22
14   2018-06-25
15   2018-06-28
16   2018-06-28
17   2018-06-28
18   2018-06-28
19   2018-07-02
20   2018-07-02
21   2018-07-05
22   2018-07-06
23   2018-07-11
24   2018-07-11
25   2018-07-11
26   2018-07-13
27   2018-07-16
28   2018-07-16
29   2018-07-17
30   2018-07-17
31   2018-07-18
32   2018-07-18
33   2018-07-18
34   2018-07-23
35   2018-07-24
36   2018-07-24
37   2018-07-24
38   2018-07-25
39   2018-07-27
Name: Date, dtype: datetime64[ns]

In [31]:
# Extracting the 'Year','Month' and 'day' from Date Column.
df['Month'] = df['Date'].dt.month_name()
df['Day'] = df['Date'].dt.day_name()

In [32]:
df.head()

,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours,0,1,2,3,Month,Day
0,2018-06-01,179,26,30,237.656,19,3,0,0,0,0,NaN,0,1,June,Friday
1,2018-06-04,361,52,28,237.656,27,1,1,4,0,1,NaN,0,0,June,Monday
2,2018-06-06,155,12,34,237.656,25,1,2,0,0,0,NaN,0,1,June,Wednesday
3,2018-06-08,179,22,40,237.656,22,2,2,0,0,0,NaN,0,1,June,Friday
4,2018-06-08,155,12,34,237.656,25,1,2,0,0,1,NaN,0,0,June,Friday

In [33]:
# converting Month and Day columns to intergers, this will help in StandardScaler
df['Month'] = df['Month'].replace(['January', 'February', 'March', 'April', 'May',
                                'June', 'July', 'August', 'September', 'October', 'November', 'December'], 
                                ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12'])
df['Day'] = df['Day'].replace(['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday'], 
                                ['1', '2', '3', '4', '5', '6', '7'])

# dropping the 'Date' Column
df = df.drop(['Date'], axis = 1)

In [34]:
df.head()

,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours,0,1,2,3,Month,Day
0,179,26,30,237.656,19,3,0,0,0,0,NaN,0,1,6,6
1,361,52,28,237.656,27,1,1,4,0,1,NaN,0,0,6,2
2,155,12,34,237.656,25,1,2,0,0,0,NaN,0,1,6,4
3,179,22,40,237.656,22,2,2,0,0,0,NaN,0,1,6,6
4,155,12,34,237.656,25,1,2,0,0,1,NaN,0,0,6,6

In [35]:
column_change = ['Transportation Expense', 'Distance to Work', 'Age', 'Daily Work Load Average', 
'Body Mass Index', 'Education', 'Children', 'Pets', 'Absenteeism_Time_in_Hours', 'Reason_1', 'Reason_2', 'Reason_3', 'Reason_4', 'Month', 'Day']

In [36]:
df.columns = column_change

In [37]:
df.head()

,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism_Time_in_Hours,Reason_1,Reason_2,Reason_3,Reason_4,Month,Day
0,179,26,30,237.656,19,3,0,0,0,0,NaN,0,1,6,6
1,361,52,28,237.656,27,1,1,4,0,1,NaN,0,0,6,2
2,155,12,34,237.656,25,1,2,0,0,0,NaN,0,1,6,4
3,179,22,40,237.656,22,2,2,0,0,0,NaN,0,1,6,6
4,155,12,34,237.656,25,1,2,0,0,1,NaN,0,0,6,6

In [38]:
# reordering the columns
column_names_reodered = ['Reason_1', 'Reason_2', 'Reason_3', 'Reason_4', 'Month', 'Day', 'Transportation Expense',
                        'Distance to Work', 'Age', 'Daily Work Load Average', 'Body Mass Index',
                        'Education', 'Children', 'Pets', 'Absenteeism_Time_in_Hours']
df = df[column_names_reodered]

In [39]:
df.head()

,Reason_1,Reason_2,Reason_3,Reason_4,Month,Day,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism_Time_in_Hours
0,0,NaN,0,1,6,6,179,26,30,237.656,19,3,0,0,0
1,1,NaN,0,0,6,2,361,52,28,237.656,27,1,1,4,0
2,0,NaN,0,1,6,4,155,12,34,237.656,25,1,2,0,0
3,0,NaN,0,1,6,6,179,22,40,237.656,22,2,2,0,0
4,1,NaN,0,0,6,6,155,12,34,237.656,25,1,2,0,0

In [40]:
# using the 'map' method to reassign the values in the Education column
df['Education'] = df['Education'].map({1:0, 2:1, 3:1, 4:1})

# replace the NaN values
df = df.fillna(value=0) 

# drop the variables we decide we don't need
df = df.drop(['Day', 'Daily Work Load Average', 'Distance to Work'], axis = 1)

In [41]:
df.head()

,Reason_1,Reason_2,Reason_3,Reason_4,Month,Transportation Expense,Age,Body Mass Index,Education,Children,Pets,Absenteeism_Time_in_Hours
0,0,0.0,0,1,6,179,30,19,1,0,0,0
1,1,0.0,0,0,6,361,28,27,0,1,4,0
2,0,0.0,0,1,6,155,34,25,0,2,0,0
3,0,0.0,0,1,6,179,40,22,1,2,0,0
4,1,0.0,0,0,6,155,34,25,0,2,0,0

In [42]:
df = df.fillna(value=0)
df.head()

,Reason_1,Reason_2,Reason_3,Reason_4,Month,Transportation Expense,Age,Body Mass Index,Education,Children,Pets,Absenteeism_Time_in_Hours
0,0,0.0,0,1,6,179,30,19,1,0,0,0
1,1,0.0,0,0,6,361,28,27,0,1,4,0
2,0,0.0,0,1,6,155,34,25,0,2,0,0
3,0,0.0,0,1,6,179,40,22,1,2,0,0
4,1,0.0,0,0,6,155,34,25,0,2,0,0